resilencelyn/gitee/open-skyeye/code/device/boardsSimulateDevice/mpc5554SimulateDevice/mpc5554_edma/mpc5554_edma.c
#include <skyeye_lock.h>
#include <skyeye_types.h>
#include <skyeye_sched.h>
#include <skyeye_signal.h>
#include <skyeye_class.h>
#include <skyeye_interface.h>
#include <skyeye_iface.h>
#include <skyeye_obj.h>
#include <skyeye_mm.h>
#include <memory_space.h>
#include <skyeye_device.h>
#include <skyeye_core.h>
#include <skyeye_signal.h>
#include <skyeye_log.h>
#include <skyeye_dev_bus_intf.h>
#include <skyeye_dev_intf.h>
#include <skyeye_uart_ops.h>
#include <skyeye_system.h>
#include <skyeye_api.h>
#define DEBUG
#include "mpc5554_edma.h"

void edma_send(conf_object_t* conf_object)
{

    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_object->obj;

    /* 开始DMA传输 */
    if ((dev->ENTxRxCH == 1)
       && (dev->regs.SERQR & CONFIG_DMA_TX))
    {
        uint8_t buf = 0;
        int i;
        uint32_t src_addr = dev->regs.TCD[CONFIG_DMA_TX].SADDR;         /* DMA 源地址 */
        uint32_t biter = dev->regs.TCD[CONFIG_DMA_TX].BITER.B.BITER;    /* DMA 开始的 minor loop 字节数 */
        uint32_t citer = dev->regs.TCD[CONFIG_DMA_TX].CITER.B.CITER;    /* DMA 当前的 minor loop 字节数 */
        uint32_t slast = dev->regs.TCD[CONFIG_DMA_TX].SLAST;            /* DMA 传输完成后对源地址的修正值 */
        uint32_t dlast = dev->regs.TCD[CONFIG_DMA_TX].DLAST_SGA;        /* DMA 传输完成后对源地址的修正值 */
        uint32_t nbytes = dev->regs.TCD[CONFIG_DMA_TX].NBYTES;          /* DMA 每次传输的字节数 */
        uint32_t dst_addr = dev->regs.TCD[CONFIG_DMA_TX].DADDR;         /* DMA 传输目的地址 */
        uint32_t tx_len = biter;

        /* 从源地址读取数据写入目的地址 */
        for (i = 0; i < tx_len; i++)
        {
            dev->memory_iface->read(dev->memory, src_addr + i, &buf, nbytes);
            dev->memory_iface->write(dev->memory, dst_addr, &buf, nbytes);
        }

        dev->regs.TCD[CONFIG_DMA_TX].CITER.B.CITER += citer;

        dev->regs.TCD[CONFIG_DMA_TX].BITER.B.DONE = 1;
        dev->regs.SERQR &= ~(CONFIG_DMA_TX);
    }
}

/* esci 接收虚拟串口数据后，EDMA接收数据缓冲区SIZE - 1 */
static int edma_recv_length(conf_object_t* conf_object, int length)
{
     mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_object->obj;
     uint32_t biter;
     uint32_t citer;
     uint8_t buf;
     int i;

     dev->SciRecvCount ++;
     dev->MinorLoopBytes = dev->regs.TCD[CONFIG_DMA_RX].NBYTES;

     /* 通知串口接收到数据 */
     dev->esci_iface->recv_edma_trans_len(dev->esci, 1);

    /* DMA 搬数据 */
    if ((dev->ENTxRxCH == 1) && (dev->regs.ERQRL & EN_DMA_RX))
    {
        /* 一个minor loop 完成 */
        if (dev->SciRecvCount % dev->MinorLoopBytes == 0)
        {
            dev->SciRxDMA_src_addr = dev->regs.TCD[CONFIG_DMA_RX].SADDR;                    /* DMA 源地址 */
            dev->SciRxDMA_dst_addr = dev->regs.TCD[CONFIG_DMA_RX].DADDR;                  /* DMA 目的地址 */
            biter = dev->regs.TCD[CONFIG_DMA_RX].BITER.B.BITER;           /* DMA 开始的 minor loop 字节数 */
            citer = dev->regs.TCD[CONFIG_DMA_RX].CITER.B.CITER;
        }

        /* 根据DOFF，NBYTES，DSIZE 设置完成一次Minorloop后加上偏移的目标地址 目前DOFF为1 */
        dev->SciRxDMA_dst_addr =  dev->SciRxDMA_dst_addr + (biter - citer ) * (dev->MinorLoopBytes);

        /* 根据SOFF，NBYTES，SSIZE 设置完成一次Minorloop后加上偏移的源地址 目前SOFF为 0 */
        /////

        /* 搬运一个MinLoop 的数据 */
        for (i = 0; i < dev->MinorLoopBytes; i++)
        {
            dev->memory_iface->read(dev->memory, dev->SciRxDMA_src_addr, &buf, 1);
            //printf("0x%x",buf);
            dev->SciRxDMA_dst_addr += i;
            dev->memory_iface->write(dev->memory, dev->SciRxDMA_dst_addr, &buf, 1);
        }
        //printf("\n");

        dev->regs.TCD[CONFIG_DMA_RX].CITER.B.CITER -= 1;
        if (dev->regs.TCD[CONFIG_DMA_RX].CITER.B.CITER == 0)
        {
            //printf("[**ESCI --> EDMA**] CITER: 0x%x | BITER: 0x%x\n", dev->regs.TCD[CONFIG_DMA_RX].CITER.B.CITER,
            //       dev->regs.TCD[CONFIG_DMA_RX].BITER.B.BITER );
            dev->regs.TCD[CONFIG_DMA_RX].CITER.B.CITER = dev->regs.TCD[CONFIG_DMA_RX].BITER.B.BITER;
        }
    }

}

/*********************************************************
*1.esi使能DMA后通过send_flag 发送标志位
*2.设置RecvDMAConf 为1，用于接收最开始初始化的值
*3.完成后设置RecvDMAConf为0
*********************************************************/
static int en_edma_send_flag(conf_object_t* conf_object, int val)
{

    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_object->obj;

    switch(val)
    {
        case DMAAllEn:
            break;
        case DMARxEn:
            break;
        case DMATxEn:
            break;
        default:
            break;
    }

    /* ESCI 已经使能DMA接收和发送，DMA 准备接收配置项 */
    dev->ENTxRxCH = 1;
}

static void En_ERQRx_Bit(mpc5554_edma_device *dev, uint8_t bit)
{
    if(bit > 31)
    {
        dev->regs.ERQRH |= (1 << (bit - 32));
    } else
    {
        dev->regs.ERQRL |= (1 << bit);
    }
}

static void Dis_ERQRx_Bit(mpc5554_edma_device *dev, uint8_t bit)
{
    if(bit > 31)
    {
        dev->regs.ERQRH &= ~(1 << (bit - 32));
    } else
    {
        dev->regs.ERQRL &= ~(1 << bit);
    }
}

// 寄存器读取操作方法
static exception_t mpc5554_edma_read(conf_object_t *conf_obj, generic_address_t offset, void *buf, size_t count)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;

    if(offset >= 0x100 && offset <= 0x13f)
    {
        uint8_t index = (offset - 0x100);
        *(uint8_t *)buf = dev->regs.CPR[index] & 0xff;

        //printf("[1]In %s | offset :  0x%x | val : 0x%x\n",__func__, offset, *(uint32_t *)buf);

        return No_exp;
    }

    if(offset >= 0x1000 && offset <= 0x17E0)
    {
        //printf("[2]In %s | offset :  0x%x | val : 0x%x\n",__func__, offset, *(uint32_t *)buf);

        uint32_t OffSet = (offset - 0x1000);
        uint32_t index = (OffSet / 0x20);
        uint32_t OFF = (OffSet % 0x20);
        uint32_t data = 0;

        switch (OFF)
        {
            case SADDR_OFF:
                data = dev->regs.TCD[index].SADDR;
                break;
            case MS_OFF:
            case MS_OFF + 0x1:
            case MS_OFF + 0x2:
            case MS_OFF + 0x3:
                data =  dev->regs.TCD[index].MS.R;
                break;
            case NBYTES_OFF:
                data =  dev->regs.TCD[index].NBYTES;
                break;
            case SLAST_OFF:
                data =  dev->regs.TCD[index].SLAST;
                break;
            case DADDR_OFF:
                data =  dev->regs.TCD[index].DADDR;
                break;
            case CITER_OFF:
            case CITER_OFF + 0x1:
            case CITER_OFF + 0x2:
            case CITER_OFF + 0x3:
                data =  dev->regs.TCD[index].CITER.R;
                break;
            case DLAST_SGA_OFF:
                data =  dev->regs.TCD[index].DLAST_SGA;
                break;
            case BITER_OFF:
            case BITER_OFF + 0x1:
            case BITER_OFF + 0x2:
            case BITER_OFF + 0x3:
                data =  dev->regs.TCD[index].BITER.R;
                break;
            default:
                printf("In %s, read error case : 0x%x\n", __FUNCTION__, OFF);
                break;
        }

        if (count == 1)
        {
            *(uint8_t *)buf = data & 0xff;
        } else if(count == 2)
        {
            *(uint16_t *)buf = data & 0xffff;
        } else
        {
            *(uint32_t *)buf = data & 0xffffffff;
        }

        //printf("[3]In %s | offset :  0x%x | val : 0x%x\n",__func__, offset, *(uint32_t *)buf);

        return No_exp;
    }

    switch (offset)
    {
        case _CR:
            *(uint32_t *)buf = dev->regs.CR;
            break;
        case _ESR:
            *(uint32_t *)buf = dev->regs.ESR;
            break;
        case _ERQRH:
            *(uint32_t *)buf = dev->regs.ERQRH;
            break;
        case _ERQRL:
            *(uint32_t *)buf = dev->regs.ERQRL;
            break;
        case _EEIRH:
            *(uint32_t *)buf = dev->regs.EEIRH;
            break;
        case _EEIRL:
            *(uint32_t *)buf = dev->regs.EEIRL;
            break;
        case _SERQR:
            *(uint32_t *)buf = dev->regs.SERQR;
            break;
        case _CERQR:
            *(uint32_t *)buf = dev->regs.CERQR;
            break;
        case _SEEIR:
            *(uint32_t *)buf = dev->regs.SEEIR;
            break;
        case _CEEIR:
            *(uint32_t *)buf = dev->regs.CEEIR;
            break;
        case _CIRQR:
            *(uint32_t *)buf = dev->regs.CIRQR;
            break;
        case _CER:
            *(uint32_t *)buf = dev->regs.CER;
            break;
        case _SSBR:
            *(uint32_t *)buf = dev->regs.SSBR;
            break;
        case _CDSBR:
            *(uint32_t *)buf = dev->regs.CDSBR;
            break;
        case _IRQRH:
            *(uint32_t *)buf = dev->regs.IRQRH;
            break;
        case _IRQRL:
            *(uint32_t *)buf = dev->regs.IRQRL;
            break;
        case _ERH:
            *(uint32_t *)buf = dev->regs.ERH;
            break;
        case _ERL:
            *(uint32_t *)buf = dev->regs.ERL;
            break;
        default:
            skyeye_log(Error_log, __FUNCTION__, "Can not read the register at 0x%x in mpc5554_edma\n", offset);
            break;
    }

