resilencelyn/gitee/open-skyeye/code/device/boardsSimulateDevice/mpc5554SimulateDevice/mpc5554_edma/mpc5554_edma.c
    //printf("[4]In %s | offset :  0x%x | val : 0x%x\n",__func__, offset, *(uint32_t *)buf);

    return No_exp;
}

// 寄存器写入操作方法
static exception_t mpc5554_edma_write(conf_object_t *conf_obj, generic_address_t offset, void *buf, size_t count)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    uint32_t val = *(uint32_t *)buf;

    //printf("In %s | offset :  0x%x | val : 0x%x\n",__func__, offset, val);

    if(offset >= 0x100 && offset <= 0x13f)
    {
        uint8_t index = (offset - 0x100);
        dev->regs.CPR[index] = val & 0xff;

        return No_exp;
    }

    if(offset >= 0x1000 && offset <= 0x17E0)
    {
        uint32_t OffSet = (offset - 0x1000);
        uint32_t index = (OffSet / 0x20);
        uint32_t OFF = (OffSet % 0x20);
        uint32_t data = 0;

        switch (OFF)
        {
            case SADDR_OFF:
                dev->regs.TCD[index].SADDR = val;
                break;
            case MS_OFF:
                if(val & 0x7)
                {
                    dev->regs.TCD[index].MS.B.SSIZE = val;
                }
                if(val & 0xf8)
                {
                    dev->regs.TCD[index].MS.B.SMOD = val >> 3;
                }
                break;
            case MS_OFF + 0x1:
                if(val & 0x7)
                {
                    dev->regs.TCD[index].MS.B.DSIZE = val;
                }
                if(val & 0xf8)
                {
                    dev->regs.TCD[index].MS.B.DMOD = val >> 3;
                }
                break;
            case MS_OFF + 0x2:
                dev->regs.TCD[index].MS.B.SOFF = val;
                break;
            case NBYTES_OFF:
                dev->regs.TCD[index].NBYTES = val;
                break;
            case SLAST_OFF:
                dev->regs.TCD[index].SLAST = val;
                break;
            case DADDR_OFF:
                dev->regs.TCD[index].DADDR = val;
                break;
            case CITER_OFF:
                if(val & 0x8000)
                {
                     dev->regs.TCD[index].CITER.B.CITERE_LINK = 1;
                }
                if(val & 0x7fff)
                {
                     dev->regs.TCD[index].CITER.B.CITER = val;
                }
                break;
            case CITER_OFF + 0x2:
                 dev->regs.TCD[index].CITER.B.DOFF = val;
                 break;
            case DLAST_SGA_OFF:
                 dev->regs.TCD[index].DLAST_SGA = val;
                break;
            case BITER_OFF:
                if(val & 0x80)
                {
                    dev->regs.TCD[index].CITER.B.CITERE_LINK = (val > 0x15);
                }
                if(val & 0x7fff)
                {
                     dev->regs.TCD[index].BITER.B.BITER = val;
                }
                break;
            case BITER_OFF + 0x2:
                if(val & 0xc000)
                {
                    dev->regs.TCD[index].BITER.B.BWC = 2;
                }
                break;
            case BITER_OFF + 0x3:
                if(val & 0x80)
                {
                    dev->regs.TCD[index].BITER.B.DONE = 1;
                }
                if(val & 0x8)
                {
                    dev->regs.TCD[index].BITER.B.D_REQ = 1;
                }
                break;
            default:
                printf("In %s, write error case : 0x%x\n", __FUNCTION__, OFF);
                break;
        }
        return No_exp;
    }

    switch (offset)
    {
        case _CR:
             dev->regs.CR = val;
             break;
        case _ESR:
            dev->regs.ESR = val;
            break;
        case _ERQRH:
            dev->regs.ERQRH = val;
            break;
        case _ERQRL:
            dev->regs.ERQRL = val;
            break;
        case _EEIRH:
            dev->regs.EEIRH = val;
            break;
        case _EEIRL:
            dev->regs.EEIRL = val;
            break;
        case _SERQR:
            dev->regs.SERQR = val & 0xff;
            En_ERQRx_Bit(dev, dev->regs.SERQR);
            if(dev->regs.SERQR & CONFIG_DMA_RX)
            {
                dev->RxEnable = 1;
            }
            edma_send(conf_obj);
            break;
        case _CERQR:
            dev->regs.CERQR = val & 0xff;
            break;
        case _SEEIR:
            dev->regs.SEEIR = val & 0xff;
            break;
        case _CEEIR:
            dev->regs.CEEIR = val & 0xff;
            break;
        case _CIRQR:
            dev->regs.CIRQR = val & 0xff;
            break;
        case _CER:
            dev->regs.CER = val & 0xff ;
            break;
        case _SSBR:
            dev->regs.SSBR = val & 0xff;
            break;
        case _CDSBR:
            dev->regs.CDSBR = val & 0xff;
            break;
        case _IRQRH:
            dev->regs.IRQRH = val;
            break;
        case _IRQRL:
            dev->regs.IRQRL = val;
            break;
        case _ERH:
            dev->regs.ERH = val;
            break;
        case _ERL:
            dev->regs.ERL = val;
             break;
        default:
                skyeye_log(Error_log, __FUNCTION__, "Can not write the register at 0x%x in mpc5554_edma\n", offset);
                break;
    }
    return No_exp;
}

// 寄存器接口:根据寄存器ID获取寄存器名
static char* mpc5554_edma_get_regname_by_id(conf_object_t *conf_obj, uint32_t id)
{
    return regs_name[id];
}

// 寄存器接口:根据寄存器ID设置寄存器值
static exception_t mpc5554_edma_set_regvalue_by_id(conf_object_t *conf_obj, uint32_t value, uint32_t id)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    struct registers *regs = &(dev->regs);

    *((uint32_t*)regs + id) = value;

    return No_exp;
}

// 寄存器接口:获取设备有多少寄存器
static uint32_t mpc5554_edma_get_regnum(conf_object_t *conf_obj)
{
    return 18;
}

// 寄存器接口:根据寄存器ID获取寄存器值
static uint32_t mpc5554_edma_get_regvalue_by_id(conf_object_t *conf_obj, uint32_t id)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    struct registers *regs = &(dev->regs);

    uint32_t* regs_value = (uint32_t*)regs + id;

    return *regs_value;
}

