resilencelyn/gitee/open-skyeye/code/device/boardsSimulateDevice/mpc5554SimulateDevice/mpc5554_edma/mpc5554_edma.c
// 寄存器接口:根据寄存器名获取寄存器ID
static uint32_t mpc5554_edma_get_regid_by_name(conf_object_t *conf_obj, char *name)
{
    uint32_t regnum = sizeof(struct registers) / 4;
    int i;

    for (i = 0; i < regnum; i++)
    {
        if (strcmp(name, regs_name[i]) == 0)
            return i;
    }

    return regnum;
}

// 寄存器接口:根据寄存器ID获取寄存器偏移
static uint32_t mpc5554_edma_get_regoffset_by_id(conf_object_t *conf_obj, uint32_t id)
{
    return regs_offset[id];
}

// 实例化一个新设备对象，obj_name是在json文件中配置的名称
static conf_object_t* new_mpc5554_edma(const char *obj_name)
{
    mpc5554_edma_device* dev = skyeye_mm_zero(sizeof(mpc5554_edma_device));
    dev->obj = new_conf_object(obj_name, dev);
    // TODO: 在此添加自定义源码

    // 寄存器初始化
    struct registers *regs = &(dev->regs);
    regs->CR = 0xe400;
    regs->ESR = 0;
    regs->ERQRH = 0;
    regs->ERQRL = 0;
    regs->EEIRH = 0;
    regs->EEIRL = 0;
    regs->SERQR = 0;
    regs->CERQR = 0;
    regs->SEEIR = 0;
    regs->CEEIR = 0;
    regs->CIRQR = 0;
    regs->CER = 0;
    regs->SSBR = 0;
    regs->CDSBR = 0;
    regs->IRQRH = 0;
    regs->IRQRL = 0;
    regs->ERH = 0;
    regs->ERL = 0;

    dev->ENTxRxCH = 1;
    dev->DMAReadLength = -1;
    dev->DMAReadFlag = -1;

    dev->sciFrameLen = 16;
    dev->sciRecvMaxLen = 4096;

    return dev->obj;
}

// 配置实例化的设备对象
static exception_t config_mpc5554_edma(conf_object_t* conf_obj)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    // TODO: 在此添加自定义源码

    return No_exp;
}

// 释放设备对象来做一些内存释放
static exception_t free_mpc5554_edma(conf_object_t* conf_obj)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;

    skyeye_free(conf_obj->objname);
    skyeye_free(conf_obj->obj);
    skyeye_free(conf_obj);

    return No_exp;
}

/* 中断控制器接口配置 */
static exception_t general_memory_space_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
    mpc5554_edma_device *dev = obj->obj;
    dev->memory = obj2;
    dev->memory_iface = (memory_space_intf *)SKY_get_iface(dev->memory, MEMORY_SPACE_INTF_NAME);
    if (dev->memory_iface == NULL)
    {
        if ( dev->memory_iface == NULL)
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", MEMORY_SPACE_INTF_NAME);
        } else
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", MEMORY_SPACE_INTF_NAME, obj2->objname);
        }

        return Not_found_exp;
    }

    return No_exp;
}

static exception_t general_memory_space_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
    mpc5554_edma_device *dev = obj->obj;
    *obj2 = dev->memory;
    *port = NULL;
    return No_exp;
}

static exception_t esci_iface_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
    mpc5554_edma_device *dev = obj->obj;
    dev->esci = obj2;
    dev->esci_iface = (memory_space_intf *)SKY_get_iface(dev->memory, ESCI_RECVFROM_EDMA);
    if (dev->esci == NULL)
    {
        if ( dev->esci_iface == NULL)
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", ESCI_RECVFROM_EDMA);
        } else
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", ESCI_RECVFROM_EDMA, obj2->objname);
        }

        return Not_found_exp;
    }

    return No_exp;
}

static exception_t esci_iface_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
    mpc5554_edma_device *dev = obj->obj;
    *obj2 = dev->esci;
    *port = NULL;
    return No_exp;
}

/* 中断控制器接口配置 */
static exception_t general_signal_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
    mpc5554_edma_device *dev =  obj->obj;
    dev->general_signal.obj = obj2;
    dev->general_signal.iface = (general_signal_iface_t *)SKY_get_iface(dev->general_signal.obj, GENERAL_SIGNAL_INTF_NAME);
    if (dev->general_signal.iface == NULL)
    {
        if ( dev->general_signal.obj == NULL)
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", GENERAL_SIGNAL_INTF_NAME);
        } else
        {
            skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", GENERAL_SIGNAL_INTF_NAME, obj2->objname);
        }

        return Not_found_exp;
    }

    return No_exp;
}

static exception_t general_signal_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
    mpc5554_edma_device *dev = obj->obj;
    *obj2 = dev->general_signal.obj;
    *port = NULL;
    return No_exp;
}

/* 设置属性 */
static exception_t set_attr_sciFrameLen(void* arg, conf_object_t* conf_obj, attr_value_t* value, attr_value_t* idx)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    dev->sciFrameLen = SKY_attr_uinteger(*value);
    return No_exp;
}

static attr_value_t get_attr_sciFrameLen(void* arg, conf_object_t* conf_obj, attr_value_t* idx)
{
    mpc5554_edma_device *dev = (mpc5554_edma_device *)conf_obj->obj;
    attr_value_t value = SKY_make_attr_uinteger(dev->sciFrameLen);
    return value;
}

static exception_t set_attr_sciRecvMaxLen(void* arg, conf_object_t* conf_obj, attr_value_t* value, attr_value_t* idx)
{
    mpc5554_edma_device *dev =  conf_obj->obj;
    dev->sciRecvMaxLen = SKY_attr_uinteger(*value);
    return No_exp;
}

static attr_value_t get_attr_sciRecvMaxLen(void* arg, conf_object_t* conf_obj, attr_value_t* idx)
{
    mpc5554_edma_device *dev =  conf_obj->obj;
    attr_value_t value = SKY_make_attr_uinteger(dev->sciRecvMaxLen);
    return value;
}

static void class_register_attribute(conf_class_t* dev_class)
{
    SKY_register_attribute(dev_class, "sciFrameLen", get_attr_sciFrameLen, NULL, set_attr_sciFrameLen, NULL, SKY_Attr_Optional, "uinteger", "this is set sciFrameLen describe");
    SKY_register_attribute(dev_class, "sciRecvMaxLen", get_attr_sciRecvMaxLen, NULL, set_attr_sciRecvMaxLen, NULL, SKY_Attr_Optional, "uinteger", "this is set sciRecvMaxLen describe");
    return;
}


