resilencelyn/gitee/open-skyeye/code/device/boardsSimulateDevice/mpc5554SimulateDevice/mpc5554_edma/mpc5554_edma.c
// 初始化模块类，并在SkyEye加载模块时执行以下代码
void init_mpc5554_edma(void)
{
    // 向SkyEye注册一个设备
    static skyeye_class_t class_data =
    {
        .class_name      = "mpc5554_edma",
        .class_desc      = "mpc5554_edma",
        .new_instance    = new_mpc5554_edma,
        .free_instance   = free_mpc5554_edma,
        .config_instance = config_mpc5554_edma,
        .module_type     = SKYML_OFFCHIP,
    };
    conf_class_t* dev_class = SKY_register_device_class(class_data.class_name, &class_data);

    // 设置寄存器地址读写方法
    static memory_space_intf io_memory_interface =
    {
        .read  = mpc5554_edma_read,
        .write = mpc5554_edma_write
    };
    SKY_register_iface(dev_class, MEMORY_SPACE_INTF_NAME, &io_memory_interface);

    // 注册访问接口(用于SkyEye图形控制接口)
    static skyeye_reg_intf reg_interface =
    {
        .get_regvalue_by_id  = mpc5554_edma_get_regvalue_by_id,
        .get_regname_by_id   = mpc5554_edma_get_regname_by_id,
        .set_regvalue_by_id  = mpc5554_edma_set_regvalue_by_id,
        .get_regnum          = mpc5554_edma_get_regnum,
        .get_regid_by_name   = mpc5554_edma_get_regid_by_name,
        .get_regoffset_by_id = mpc5554_edma_get_regoffset_by_id
    };
    SKY_register_iface(dev_class, SKYEYE_REG_INTF, &reg_interface);

    static esci_sendto_edma_intf edma_intf =
    {
        .send_flag = en_edma_send_flag,
        .recv_length = edma_recv_length
    };
    SKY_register_iface(dev_class, ESCI_SENDTO_EDMA, &edma_intf);

    // 接口方法列表
    static const struct InterfaceDescription ifaces[] =
    {
        (struct InterfaceDescription)
        {
            .name  = MEMORY_SPACE_INTF_NAME,
            .iface = &io_memory_interface
        },
        (struct InterfaceDescription)
        {
            .name  = SKYEYE_REG_INTF,
            .iface = &reg_interface
        },
        (struct InterfaceDescription)
        {
            .name  = ESCI_SENDTO_EDMA,
            .iface = &edma_intf
        }
    };

    // 接口连接方法列表
    static const struct ConnectDescription connects[] =
    {
        /* ConnectDescription */
        (struct ConnectDescription )
        {
            .name = GENERAL_SIGNAL_INTF_NAME,
            .set = general_signal_set,
            .get = general_signal_get,
        },
        (struct ConnectDescription )
        {
            .name = ESCI_RECVFROM_EDMA,
            .set = esci_iface_set,
            .get = esci_iface_get,
        },
        (struct ConnectDescription)
        {
            .name = MEMORY_SPACE_INTF_NAME,
            .set = general_memory_space_set,
            .get = general_memory_space_get,
        }
    };
    class_register_ifaces(dev_class, ifaces);
    class_register_connects(dev_class, connects);
}
